SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USART/MM32F5370_Bootloader/Device/MM32F5370/Include/reg_rcc.h
/***********************************************************************************************************************
    @file     reg_rcc.h
    @author   VV TEAM
    @brief    This flie contains all the RCC's register and its field definition.
  **********************************************************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
       the following disclaimer in the documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
       promote products derived from this software without specific prior written permission.

      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *********************************************************************************************************************/

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/

#ifndef __REG_RCC_H
#define __REG_RCC_H


/* Files includes ----------------------------------------------------------------------------------------------------*/
#include "core_starmc1.h"



/**
  * @brief RCC Base Address Definition
  */
#define  RCC_BASE                                  0x40021000                                       /*!<Base Address: 0x40021000*/

/**
  * @brief RCC Register Structure Definition
  */
typedef struct
{
    __IO uint32_t CR;                             /*!<RCC Clock Control Register                     offset: 0x00       */
    __IO uint32_t CFGR;                           /*!<RCC Clock Configuration Register               offset: 0x04       */
    __IO uint32_t CIR;                            /*!<RCC Clock Interrupt Register                   offset: 0x08       */
    __IO uint32_t RESERVED0x0C[1];                /*!<                                               offset: 0x0C       */
    __IO uint32_t AHBRSTR2;                       /*!<RCC AHB Peripheral Reset Register2             offset: 0x10       */
    __IO uint32_t AHBRSTR;                        /*!<RCC AHB Peripheral Reset Register              offset: 0x14       */
    __IO uint32_t APB2RSTR;                       /*!<RCC APB2 Peripheral Reset Register             offset: 0x18       */
    __IO uint32_t APB1RSTR;                       /*!<RCC APB1 Peripheral Reset Register             offset: 0x1C       */
    __IO uint32_t RESERVED0x20[1];                /*!<                                               offset: 0x20       */
    __IO uint32_t AHBENR2;                        /*!<RCC AHB Peripheral Clock Enable Register2      offset: 0x24       */
    __IO uint32_t AHBENR;                         /*!<RCC AHB Peripheral Clock Enable Register       offset: 0x28       */
    __IO uint32_t APB2ENR;                        /*!<RCC APB2 Peripheral Clock Enable Register      offset: 0x2C       */
    __IO uint32_t APB1ENR;                        /*!<RCC APB1Peripheral Clock Enable Register       offset: 0x30       */
    __IO uint32_t BDCR;                           /*!<                                               offset: 0x34       */
    __IO uint32_t CSR;                            /*!<RCC Control Status Register                    offset: 0x38       */
    __IO uint32_t SYSCFGR;                        /*!<RCC System Configuration Register              offset: 0x3C       */
    __IO uint32_t CFGR2;                          /*!<RCC Clock Configuration Register 2             offset: 0x40       */
    __IO uint32_t ICSCR;                          /*!<                                               offset: 0x44       */
    __IO uint32_t PLL1CFGR;                       /*!<RCC PLL1 Configuration Register                offset: 0x48       */
    __IO uint32_t PLL2CFGR;                       /*!<RCC PLL2 Configuration Register                offset: 0x4C       */
    __IO uint32_t CFGR3;                          /*!<RCC Clock Configuration Register 3             offset: 0x50       */
    __IO uint32_t RESERVED0x54[1];                /*!<                                               offset: 0x54       */
    __IO uint32_t CANCFGR;                        /*!<RCC FLexCAN Configuration Register             offset: 0x58       */
    __IO uint32_t RESERVED0x5C[1];                /*!<                                               offset: 0x5C       */
    __IO uint32_t ADC1CFGR;                       /*!<RCC ADC1 Configuration Register                offset: 0x60       */
    __IO uint32_t ADC2CFGR;                       /*!<RCC ADC2 Configuration Register                offset: 0x64       */
    __IO uint32_t ADC3CFGR;                       /*!<RCC ADC3 Configuration Register                offset: 0x68       */
    __IO uint32_t RESERVED0x6C[1];                /*!<                                               offset: 0x6C       */
    __IO uint32_t DACCFGR;                        /*!<RCC DAC Configuration Register                 offset: 0x70       */
    __IO uint32_t RESERVED0x74[2];                /*!<                                               offset: 0x74~0x78  */
    __IO uint32_t TPIUCFGR;                       /*!<RCC TPIU Configuration Register                offset: 0x7C       */
} RCC_TypeDef;

/**
  * @brief RCC type pointer Definition
  */
#define RCC                                       ((RCC_TypeDef *)RCC_BASE)

/**
  * @brief RCC_CR Register Bit Definition
  */
#define  RCC_CR_HSION_Pos                         (0)
#define  RCC_CR_HSION_Msk                         (0x1U << RCC_CR_HSION_Pos)                        /*!<Internal High-speed Clock Enable*/
#define  RCC_CR_HSION                             RCC_CR_HSION_Msk
#define  RCC_CR_HSIRDY_Pos                        (1)
#define  RCC_CR_HSIRDY_Msk                        (0x1U << RCC_CR_HSIRDY_Pos)                       /*!<Internal High-speed Clock Ready Flag*/
#define  RCC_CR_HSIRDY                            RCC_CR_HSIRDY_Msk
#define  RCC_CR_HSELPFBYP_Pos                     (4)
#define  RCC_CR_HSELPFBYP_Msk                     (0x1U << RCC_CR_HSELPFBYP_Pos)                    /*!<Enable signal that LPF input signal directly output*/
#define  RCC_CR_HSELPFBYP                         RCC_CR_HSELPFBYP_Msk
#define  RCC_CR_HSELPFSEL_Pos                     (5)
#define  RCC_CR_HSELPFSEL_Msk                     (0x1U << RCC_CR_HSELPFSEL_Pos)                    /*!<LPF filter mode control*/
#define  RCC_CR_HSELPFSEL                         RCC_CR_HSELPFSEL_Msk
#define  RCC_CR_HSEDEGLITCHBYP_Pos                (6)
#define  RCC_CR_HSEDEGLITCHBYP_Msk                (0x1U << RCC_CR_HSEDEGLITCHBYP_Pos)               /*!<Deburring Circuit Bypass Control Bit*/
#define  RCC_CR_HSEDEGLITCHBYP                    RCC_CR_HSEDEGLITCHBYP_Msk
#define  RCC_CR_HSEDEGLITCHSEL_Pos                (7)
#define  RCC_CR_HSEDEGLITCHSEL_Msk                (0x1U << RCC_CR_HSEDEGLITCHSEL_Pos)               /*!<Deburring Width Control Bit*/
#define  RCC_CR_HSEDEGLITCHSEL                    RCC_CR_HSEDEGLITCHSEL_Msk
#define  RCC_CR_HSEOUTPUTSEL_Pos                  (8)
#define  RCC_CR_HSEOUTPUTSEL_Msk                  (0x1U << RCC_CR_HSEOUTPUTSEL_Pos)                 /*!<Output Mode Selector*/
#define  RCC_CR_HSEOUTPUTSEL                      RCC_CR_HSEOUTPUTSEL_Msk
#define  RCC_CR_HSEDR_Pos                         (9)
#define  RCC_CR_HSEDR_Msk                         (0x3U << RCC_CR_HSEDR_Pos)                        /*!<HSE Driver Ability*/
#define  RCC_CR_HSEDR                             RCC_CR_HSEDR_Msk
#define  RCC_CR_HSEDR_Bit0                        (0x1U << RCC_CR_HSEDR_Pos) 
#define  RCC_CR_HSEDR_Bit1                        (0x2U << RCC_CR_HSEDR_Pos) 
#define  RCC_CR_HSIDIV_Pos                        (11)
#define  RCC_CR_HSIDIV_Msk                        (0x7U << RCC_CR_HSIDIV_Pos)                       /*!<HSIDIV: Internal high-speed clock division factor*/
#define  RCC_CR_HSIDIV                            RCC_CR_HSIDIV_Msk
#define  RCC_CR_HSIDIV_Bit0                       (0x1U << RCC_CR_HSIDIV_Pos) 
#define  RCC_CR_HSIDIV_Bit1                       (0x2U << RCC_CR_HSIDIV_Pos) 
#define  RCC_CR_HSIDIV_Bit2                       (0x4U << RCC_CR_HSIDIV_Pos) 
#define  RCC_CR_HSEON_Pos                         (16)
#define  RCC_CR_HSEON_Msk                         (0x1U << RCC_CR_HSEON_Pos)                        /*!<External High-speed Clock Enable*/
#define  RCC_CR_HSEON                             RCC_CR_HSEON_Msk
#define  RCC_CR_HSERDY_Pos                        (17)
#define  RCC_CR_HSERDY_Msk                        (0x1U << RCC_CR_HSERDY_Pos)                       /*!<External High-speed Clock Ready Flag*/
#define  RCC_CR_HSERDY                            RCC_CR_HSERDY_Msk
#define  RCC_CR_HSEBYP_Pos                        (18)
#define  RCC_CR_HSEBYP_Msk                        (0x1U << RCC_CR_HSEBYP_Pos)                       /*!<External High-speed Clock Bypass*/
#define  RCC_CR_HSEBYP                            RCC_CR_HSEBYP_Msk
#define  RCC_CR_CSSON_Pos                         (19)
#define  RCC_CR_CSSON_Msk                         (0x1U << RCC_CR_CSSON_Pos)                        /*!<Clock Security System High Enable*/
#define  RCC_CR_CSSON                             RCC_CR_CSSON_Msk
#define  RCC_CR_HSEAACSEL_Pos                     (21)
#define  RCC_CR_HSEAACSEL_Msk                     (0x1U << RCC_CR_HSEAACSEL_Pos)                    /*!<HSE Amplitude Auto Calibration Select*/
#define  RCC_CR_HSEAACSEL                         RCC_CR_HSEAACSEL_Msk
#define  RCC_CR_HSEIB_Pos                         (22)
#define  RCC_CR_HSEIB_Msk                         (0x3U << RCC_CR_HSEIB_Pos)                        /*!<HSE Current Mode Select*/
#define  RCC_CR_HSEIB                             RCC_CR_HSEIB_Msk
#define  RCC_CR_HSEIB_Bit0                        (0x1U << RCC_CR_HSEIB_Pos) 
#define  RCC_CR_HSEIB_Bit1                        (0x2U << RCC_CR_HSEIB_Pos) 
#define  RCC_CR_PLL1ON_Pos                        (24)
#define  RCC_CR_PLL1ON_Msk                        (0x1U << RCC_CR_PLL1ON_Pos)                       /*!<PLL1 Enable*/
#define  RCC_CR_PLL1ON                            RCC_CR_PLL1ON_Msk
#define  RCC_CR_PLL1RDY_Pos                       (25)
#define  RCC_CR_PLL1RDY_Msk                       (0x1U << RCC_CR_PLL1RDY_Pos)                      /*!<PLL1 Clock Ready Flag(Set by hardware)*/
#define  RCC_CR_PLL1RDY                           RCC_CR_PLL1RDY_Msk
#define  RCC_CR_PLL2ON_Pos                        (28)
#define  RCC_CR_PLL2ON_Msk                        (0x1U << RCC_CR_PLL2ON_Pos)                       /*!<PLL2 Enable*/
#define  RCC_CR_PLL2ON                            RCC_CR_PLL2ON_Msk
#define  RCC_CR_PLL2RDY_Pos                       (29)
#define  RCC_CR_PLL2RDY_Msk                       (0x1U << RCC_CR_PLL2RDY_Pos)                      /*!<PLL2 Clock Ready Flag(Set by hardware)*/
#define  RCC_CR_PLL2RDY                           RCC_CR_PLL2RDY_Msk

/**
  * @brief RCC_CFGR Register Bit Definition
  */
#define  RCC_CFGR_SW_Pos                          (0)
#define  RCC_CFGR_SW_Msk                          (0x3U << RCC_CFGR_SW_Pos)                         /*!<System Clock Switch*/
#define  RCC_CFGR_SW                              RCC_CFGR_SW_Msk
#define  RCC_CFGR_SW_Bit0                         (0x1U << RCC_CFGR_SW_Pos) 
#define  RCC_CFGR_SW_Bit1                         (0x2U << RCC_CFGR_SW_Pos) 
#define  RCC_CFGR_SWS_Pos                         (2)
#define  RCC_CFGR_SWS_Msk                         (0x3U << RCC_CFGR_SWS_Pos)                        /*!<System clock selection status*/
#define  RCC_CFGR_SWS                             RCC_CFGR_SWS_Msk
#define  RCC_CFGR_SWS_Bit0                        (0x1U << RCC_CFGR_SWS_Pos) 
#define  RCC_CFGR_SWS_Bit1                        (0x2U << RCC_CFGR_SWS_Pos) 
#define  RCC_CFGR_HPRE_Pos                        (4)
#define  RCC_CFGR_HPRE_Msk                        (0xFU << RCC_CFGR_HPRE_Pos)                       /*!<AHB prescaler coefficient*/
#define  RCC_CFGR_HPRE                            RCC_CFGR_HPRE_Msk
#define  RCC_CFGR_HPRE_Bit0                       (0x1U << RCC_CFGR_HPRE_Pos) 
#define  RCC_CFGR_HPRE_Bit1                       (0x2U << RCC_CFGR_HPRE_Pos) 
#define  RCC_CFGR_HPRE_Bit2                       (0x4U << RCC_CFGR_HPRE_Pos) 
#define  RCC_CFGR_HPRE_Bit3                       (0x8U << RCC_CFGR_HPRE_Pos) 
#define  RCC_CFGR_PPRE1_Pos                       (8)
#define  RCC_CFGR_PPRE1_Msk                       (0x7U << RCC_CFGR_PPRE1_Pos)                      /*!<APB1 prescaler coefficient*/
#define  RCC_CFGR_PPRE1                           RCC_CFGR_PPRE1_Msk
#define  RCC_CFGR_PPRE1_Bit0                      (0x1U << RCC_CFGR_PPRE1_Pos) 
#define  RCC_CFGR_PPRE1_Bit1                      (0x2U << RCC_CFGR_PPRE1_Pos) 
#define  RCC_CFGR_PPRE1_Bit2                      (0x4U << RCC_CFGR_PPRE1_Pos) 
#define  RCC_CFGR_PPRE2_Pos                       (11)
#define  RCC_CFGR_PPRE2_Msk                       (0x7U << RCC_CFGR_PPRE2_Pos)                      /*!<APB2 prescaler coefficient*/
#define  RCC_CFGR_PPRE2                           RCC_CFGR_PPRE2_Msk
#define  RCC_CFGR_PPRE2_Bit0                      (0x1U << RCC_CFGR_PPRE2_Pos) 
#define  RCC_CFGR_PPRE2_Bit1                      (0x2U << RCC_CFGR_PPRE2_Pos) 
#define  RCC_CFGR_PPRE2_Bit2                      (0x4U << RCC_CFGR_PPRE2_Pos) 
#define  RCC_CFGR_ADC1CLKSEL_Pos                  (16)
#define  RCC_CFGR_ADC1CLKSEL_Msk                  (0x1U << RCC_CFGR_ADC1CLKSEL_Pos)                 /*!<*/
#define  RCC_CFGR_ADC1CLKSEL                      RCC_CFGR_ADC1CLKSEL_Msk
#define  RCC_CFGR_ADC2CLKSEL_Pos                  (17)
#define  RCC_CFGR_ADC2CLKSEL_Msk                  (0x1U << RCC_CFGR_ADC2CLKSEL_Pos)                 /*!<*/
#define  RCC_CFGR_ADC2CLKSEL                      RCC_CFGR_ADC2CLKSEL_Msk
#define  RCC_CFGR_ADC3CLKSEL_Pos                  (18)
#define  RCC_CFGR_ADC3CLKSEL_Msk                  (0x1U << RCC_CFGR_ADC3CLKSEL_Pos)                 /*!<*/
#define  RCC_CFGR_ADC3CLKSEL                      RCC_CFGR_ADC3CLKSEL_Msk
#define  RCC_CFGR_USBCLKSEL_Pos                   (19)
#define  RCC_CFGR_USBCLKSEL_Msk                   (0x1U << RCC_CFGR_USBCLKSEL_Pos)                  /*!<*/
#define  RCC_CFGR_USBCLKSEL                       RCC_CFGR_USBCLKSEL_Msk
#define  RCC_CFGR_USBPRE_Pos                      (22)
#define  RCC_CFGR_USBPRE_Msk                      (0x3U << RCC_CFGR_USBPRE_Pos)                     /*!<*/
#define  RCC_CFGR_USBPRE                          RCC_CFGR_USBPRE_Msk
#define  RCC_CFGR_USBPRE_Bit0                     (0x1U << RCC_CFGR_USBPRE_Pos) 
#define  RCC_CFGR_USBPRE_Bit1                     (0x2U << RCC_CFGR_USBPRE_Pos) 
#define  RCC_CFGR_MCO_Pos                         (24)
#define  RCC_CFGR_MCO_Msk                         (0xFU << RCC_CFGR_MCO_Pos)                        /*!<Micro Controller Clock Output*/
#define  RCC_CFGR_MCO                             RCC_CFGR_MCO_Msk
#define  RCC_CFGR_MCO_Bit0                        (0x1U << RCC_CFGR_MCO_Pos) 
#define  RCC_CFGR_MCO_Bit1                        (0x2U << RCC_CFGR_MCO_Pos) 
#define  RCC_CFGR_MCO_Bit2                        (0x4U << RCC_CFGR_MCO_Pos) 
#define  RCC_CFGR_MCO_Bit3                        (0x8U << RCC_CFGR_MCO_Pos) 

/**
  * @brief RCC_CIR Register Bit Definition
  */
#define  RCC_CIR_LSIRDYF_Pos                      (0)
#define  RCC_CIR_LSIRDYF_Msk                      (0x1U << RCC_CIR_LSIRDYF_Pos)                     /*!<LSI Ready Interrupt Flag*/
#define  RCC_CIR_LSIRDYF                          RCC_CIR_LSIRDYF_Msk
#define  RCC_CIR_LSERDYF_Pos                      (1)
#define  RCC_CIR_LSERDYF_Msk                      (0x1U << RCC_CIR_LSERDYF_Pos)                     /*!<LSE Ready Interrupt Flag When the low-speed external clock is ready, set '1' by hardware. Clear by setting LSERDYC bit as '1'by software.*/
#define  RCC_CIR_LSERDYF                          RCC_CIR_LSERDYF_Msk
#define  RCC_CIR_HSIRDYF_Pos                      (2)
#define  RCC_CIR_HSIRDYF_Msk                      (0x1U << RCC_CIR_HSIRDYF_Pos)                     /*!<HSI Ready Interrupt Flag*/
#define  RCC_CIR_HSIRDYF                          RCC_CIR_HSIRDYF_Msk
#define  RCC_CIR_HSERDYF_Pos                      (3)
#define  RCC_CIR_HSERDYF_Msk                      (0x1U << RCC_CIR_HSERDYF_Pos)                     /*!<HSE Ready Interrupt Flag*/
#define  RCC_CIR_HSERDYF                          RCC_CIR_HSERDYF_Msk
#define  RCC_CIR_PLL1RDYF_Pos                     (4)
#define  RCC_CIR_PLL1RDYF_Msk                     (0x1U << RCC_CIR_PLL1RDYF_Pos)                    /*!<PLL1 Ready Interrupt Flag*/
#define  RCC_CIR_PLL1RDYF                         RCC_CIR_PLL1RDYF_Msk
#define  RCC_CIR_PLL2RDYF_Pos                     (5)
#define  RCC_CIR_PLL2RDYF_Msk                     (0x1U << RCC_CIR_PLL2RDYF_Pos)                    /*!<PLL2 Ready Interrupt Flag When PLL2 is ready, set '1' by hardware. Clear by setting PLL2RDYC bit as '1'by software.*/
#define  RCC_CIR_PLL2RDYF                         RCC_CIR_PLL2RDYF_Msk
#define  RCC_CIR_CSSF_Pos                         (7)
#define  RCC_CIR_CSSF_Msk                         (0x1U << RCC_CIR_CSSF_Pos)                        /*!<Clock security system interrupt flag*/
#define  RCC_CIR_CSSF                             RCC_CIR_CSSF_Msk
#define  RCC_CIR_LSIRDYIE_Pos                     (8)
#define  RCC_CIR_LSIRDYIE_Msk                     (0x1U << RCC_CIR_LSIRDYIE_Pos)                    /*!<LSI Ready Interrupt Enable*/
#define  RCC_CIR_LSIRDYIE                         RCC_CIR_LSIRDYIE_Msk
#define  RCC_CIR_LSERDYIE_Pos                     (9)
#define  RCC_CIR_LSERDYIE_Msk                     (0x1U << RCC_CIR_LSERDYIE_Pos)                    /*!<LSE Ready Interrupt Enable Set '1' by software to enable or clear '0' to disable external 32KHz oscillator ready interrupt.*/
#define  RCC_CIR_LSERDYIE                         RCC_CIR_LSERDYIE_Msk
#define  RCC_CIR_HSIRDYIE_Pos                     (10)
#define  RCC_CIR_HSIRDYIE_Msk                     (0x1U << RCC_CIR_HSIRDYIE_Pos)                    /*!<HSI Ready Interrupt Enable*/
#define  RCC_CIR_HSIRDYIE                         RCC_CIR_HSIRDYIE_Msk
#define  RCC_CIR_HSERDYIE_Pos                     (11)
#define  RCC_CIR_HSERDYIE_Msk                     (0x1U << RCC_CIR_HSERDYIE_Pos)                    /*!<HSE Ready Interrupt Enable*/
#define  RCC_CIR_HSERDYIE                         RCC_CIR_HSERDYIE_Msk
#define  RCC_CIR_PLL1RDYIE_Pos                    (12)
#define  RCC_CIR_PLL1RDYIE_Msk                    (0x1U << RCC_CIR_PLL1RDYIE_Pos)                   /*!<PLL1 Ready Interrupt Enable*/
#define  RCC_CIR_PLL1RDYIE                        RCC_CIR_PLL1RDYIE_Msk
#define  RCC_CIR_PLL2RDYIE_Pos                    (13)
#define  RCC_CIR_PLL2RDYIE_Msk                    (0x1U << RCC_CIR_PLL2RDYIE_Pos)                   /*!<PLL2 Ready Interrupt Enable Set '1' by software to enable or clear '0' to disable PLL2 ready interrupt.*/
#define  RCC_CIR_PLL2RDYIE                        RCC_CIR_PLL2RDYIE_Msk
#define  RCC_CIR_LSIRDYC_Pos                      (16)
#define  RCC_CIR_LSIRDYC_Msk                      (0x1U << RCC_CIR_LSIRDYC_Pos)                     /*!<LSI Ready Interrupt Clear*/
#define  RCC_CIR_LSIRDYC                          RCC_CIR_LSIRDYC_Msk
#define  RCC_CIR_LSERDYC_Pos                      (17)
#define  RCC_CIR_LSERDYC_Msk                      (0x1U << RCC_CIR_LSERDYC_Pos)                     /*!<LSE Ready Interrupt Clear Set '1' by software to clear LSE ready interrupt flag bit LSERDYF*/
#define  RCC_CIR_LSERDYC                          RCC_CIR_LSERDYC_Msk
#define  RCC_CIR_HSIRDYC_Pos                      (18)
#define  RCC_CIR_HSIRDYC_Msk                      (0x1U << RCC_CIR_HSIRDYC_Pos)                     /*!<HSI Ready Interrupt Clear*/
#define  RCC_CIR_HSIRDYC                          RCC_CIR_HSIRDYC_Msk
#define  RCC_CIR_HSERDYC_Pos                      (19)
#define  RCC_CIR_HSERDYC_Msk                      (0x1U << RCC_CIR_HSERDYC_Pos)                     /*!<HSE Ready Interrupt Clear*/
#define  RCC_CIR_HSERDYC                          RCC_CIR_HSERDYC_Msk
#define  RCC_CIR_PLL1RDYC_Pos                     (20)
#define  RCC_CIR_PLL1RDYC_Msk                     (0x1U << RCC_CIR_PLL1RDYC_Pos)                    /*!<PLL1 Ready Interrupt Clear Set '1' by software to clear PLL1 ready interrupt flag bit PLL1RDYF*/
#define  RCC_CIR_PLL1RDYC                         RCC_CIR_PLL1RDYC_Msk
#define  RCC_CIR_PLL2RDYC_Pos                     (21)
#define  RCC_CIR_PLL2RDYC_Msk                     (0x1U << RCC_CIR_PLL2RDYC_Pos)                    /*!<PLL2 Ready Interrupt Clear Set '1' by software to clear PLL2 ready interrupt flag bit PLL2RDYF*/
#define  RCC_CIR_PLL2RDYC                         RCC_CIR_PLL2RDYC_Msk
#define  RCC_CIR_CSSC_Pos                         (23)
#define  RCC_CIR_CSSC_Msk                         (0x1U << RCC_CIR_CSSC_Pos)                        /*!<Clock security system interrupt clear*/
#define  RCC_CIR_CSSC                             RCC_CIR_CSSC_Msk

/**
  * @brief RCC_AHBRSTR2 Register Bit Definition
  */
#define  RCC_AHBRSTR2_BKRAM_Pos                   (28)
#define  RCC_AHBRSTR2_BKRAM_Msk                   (0x1U << RCC_AHBRSTR2_BKRAM_Pos)                  /*!<*/
#define  RCC_AHBRSTR2_BKRAM                       RCC_AHBRSTR2_BKRAM_Msk

