SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USART/MM32F5370_Bootloader/Device/MM32F5370/Include/reg_rcc.h
/**
  * @brief RCC_AHBRSTR Register Bit Definition
  */
#define  RCC_AHBRSTR_GPIOA_Pos                    (0)
#define  RCC_AHBRSTR_GPIOA_Msk                    (0x1U << RCC_AHBRSTR_GPIOA_Pos)                   /*!<GPIOA Reset*/
#define  RCC_AHBRSTR_GPIOA                        RCC_AHBRSTR_GPIOA_Msk
#define  RCC_AHBRSTR_GPIOB_Pos                    (1)
#define  RCC_AHBRSTR_GPIOB_Msk                    (0x1U << RCC_AHBRSTR_GPIOB_Pos)                   /*!<GPIOB Reset*/
#define  RCC_AHBRSTR_GPIOB                        RCC_AHBRSTR_GPIOB_Msk
#define  RCC_AHBRSTR_GPIOC_Pos                    (2)
#define  RCC_AHBRSTR_GPIOC_Msk                    (0x1U << RCC_AHBRSTR_GPIOC_Pos)                   /*!<GPIOC Reset*/
#define  RCC_AHBRSTR_GPIOC                        RCC_AHBRSTR_GPIOC_Msk
#define  RCC_AHBRSTR_GPIOD_Pos                    (3)
#define  RCC_AHBRSTR_GPIOD_Msk                    (0x1U << RCC_AHBRSTR_GPIOD_Pos)                   /*!<GPIOD Reset*/
#define  RCC_AHBRSTR_GPIOD                        RCC_AHBRSTR_GPIOD_Msk
#define  RCC_AHBRSTR_GPIOE_Pos                    (4)
#define  RCC_AHBRSTR_GPIOE_Msk                    (0x1U << RCC_AHBRSTR_GPIOE_Pos)                   /*!<GPIOE Reset Set '1' or clear '0' by software*/
#define  RCC_AHBRSTR_GPIOE                        RCC_AHBRSTR_GPIOE_Msk
#define  RCC_AHBRSTR_GPIOF_Pos                    (5)
#define  RCC_AHBRSTR_GPIOF_Msk                    (0x1U << RCC_AHBRSTR_GPIOF_Pos)                   /*!<GPIOF Reset Set '1' or clear '0' by software*/
#define  RCC_AHBRSTR_GPIOF                        RCC_AHBRSTR_GPIOF_Msk
#define  RCC_AHBRSTR_GPIOH_Pos                    (7)
#define  RCC_AHBRSTR_GPIOH_Msk                    (0x1U << RCC_AHBRSTR_GPIOH_Pos)                   /*!<GPIOH Reset Set '1' or clear '0' by software*/
#define  RCC_AHBRSTR_GPIOH                        RCC_AHBRSTR_GPIOH_Msk
#define  RCC_AHBRSTR_GPIOI_Pos                    (8)
#define  RCC_AHBRSTR_GPIOI_Msk                    (0x1U << RCC_AHBRSTR_GPIOI_Pos)                   /*!<GPIOI Reset Set '1' or clear '0' by software*/
#define  RCC_AHBRSTR_GPIOI                        RCC_AHBRSTR_GPIOI_Msk
#define  RCC_AHBRSTR_CRC_Pos                      (12)
#define  RCC_AHBRSTR_CRC_Msk                      (0x1U << RCC_AHBRSTR_CRC_Pos)                     /*!<CRC Reset Set '1' or clear '0' by software*/
#define  RCC_AHBRSTR_CRC                          RCC_AHBRSTR_CRC_Msk
#define  RCC_AHBRSTR_CORDIC_Pos                   (15)
#define  RCC_AHBRSTR_CORDIC_Msk                   (0x1U << RCC_AHBRSTR_CORDIC_Pos)                  /*!<CORDIC Reset Set '1' or clear '0' by software*/
#define  RCC_AHBRSTR_CORDIC                       RCC_AHBRSTR_CORDIC_Msk
#define  RCC_AHBRSTR_DMA1_Pos                     (21)
#define  RCC_AHBRSTR_DMA1_Msk                     (0x1U << RCC_AHBRSTR_DMA1_Pos)                    /*!<DMA1 Reset Set '1' or clear '0' by software*/
#define  RCC_AHBRSTR_DMA1                         RCC_AHBRSTR_DMA1_Msk
#define  RCC_AHBRSTR_DMA2_Pos                     (22)
#define  RCC_AHBRSTR_DMA2_Msk                     (0x1U << RCC_AHBRSTR_DMA2_Pos)                    /*!<DMA2 Reset Set '1' or clear '0' by software*/
#define  RCC_AHBRSTR_DMA2                         RCC_AHBRSTR_DMA2_Msk
#define  RCC_AHBRSTR_USB_FS_Pos                   (24)
#define  RCC_AHBRSTR_USB_FS_Msk                   (0x1U << RCC_AHBRSTR_USB_FS_Pos)                  /*!<USB_FS Reset Set '1' or clear '0' by software*/
#define  RCC_AHBRSTR_USB_FS                       RCC_AHBRSTR_USB_FS_Msk
#define  RCC_AHBRSTR_QSPI_Pos                     (30)
#define  RCC_AHBRSTR_QSPI_Msk                     (0x1U << RCC_AHBRSTR_QSPI_Pos)                    /*!<QSPI Reset Set '1' or clear '0' by software*/
#define  RCC_AHBRSTR_QSPI                         RCC_AHBRSTR_QSPI_Msk

/**
  * @brief RCC_APB2RSTR Register Bit Definition
  */
#define  RCC_APB2RSTR_TIM1_Pos                    (0)
#define  RCC_APB2RSTR_TIM1_Msk                    (0x1U << RCC_APB2RSTR_TIM1_Pos)                   /*!<TIM1 Reset*/
#define  RCC_APB2RSTR_TIM1                        RCC_APB2RSTR_TIM1_Msk
#define  RCC_APB2RSTR_TIM8_Pos                    (1)
#define  RCC_APB2RSTR_TIM8_Msk                    (0x1U << RCC_APB2RSTR_TIM8_Pos)                   /*!<TIM8 Reset*/
#define  RCC_APB2RSTR_TIM8                        RCC_APB2RSTR_TIM8_Msk
#define  RCC_APB2RSTR_USART1_Pos                  (4)
#define  RCC_APB2RSTR_USART1_Msk                  (0x1U << RCC_APB2RSTR_USART1_Pos)                 /*!<USART1 Reset*/
#define  RCC_APB2RSTR_USART1                      RCC_APB2RSTR_USART1_Msk
#define  RCC_APB2RSTR_ADC1_Pos                    (8)
#define  RCC_APB2RSTR_ADC1_Msk                    (0x1U << RCC_APB2RSTR_ADC1_Pos)                   /*!<ADC1 Reset*/
#define  RCC_APB2RSTR_ADC1                        RCC_APB2RSTR_ADC1_Msk
#define  RCC_APB2RSTR_ADC2_Pos                    (9)
#define  RCC_APB2RSTR_ADC2_Msk                    (0x1U << RCC_APB2RSTR_ADC2_Pos)                   /*!<ADC2 Reset*/
#define  RCC_APB2RSTR_ADC2                        RCC_APB2RSTR_ADC2_Msk
#define  RCC_APB2RSTR_ADC3_Pos                    (10)
#define  RCC_APB2RSTR_ADC3_Msk                    (0x1U << RCC_APB2RSTR_ADC3_Pos)                   /*!<ADC3 Reset*/
#define  RCC_APB2RSTR_ADC3                        RCC_APB2RSTR_ADC3_Msk
#define  RCC_APB2RSTR_SPI1_Pos                    (12)
#define  RCC_APB2RSTR_SPI1_Msk                    (0x1U << RCC_APB2RSTR_SPI1_Pos)                   /*!<SPI1 Reset*/
#define  RCC_APB2RSTR_SPI1                        RCC_APB2RSTR_SPI1_Msk
#define  RCC_APB2RSTR_SYSCFG_Pos                  (14)
#define  RCC_APB2RSTR_SYSCFG_Msk                  (0x1U << RCC_APB2RSTR_SYSCFG_Pos)                 /*!<SYSCFG Reset*/
#define  RCC_APB2RSTR_SYSCFG                      RCC_APB2RSTR_SYSCFG_Msk
#define  RCC_APB2RSTR_COMP_Pos                    (15)
#define  RCC_APB2RSTR_COMP_Msk                    (0x1U << RCC_APB2RSTR_COMP_Pos)                   /*!<Comparator reset Set to '1' or clear '0' by software*/
#define  RCC_APB2RSTR_COMP                        RCC_APB2RSTR_COMP_Msk
#define  RCC_APB2RSTR_FLEXCAN2_Pos                (24)
#define  RCC_APB2RSTR_FLEXCAN2_Msk                (0x1U << RCC_APB2RSTR_FLEXCAN2_Pos)               /*!<FLEXCAN2 Reset Set to '1' or clear '0' by software*/
#define  RCC_APB2RSTR_FLEXCAN2                    RCC_APB2RSTR_FLEXCAN2_Msk
#define  RCC_APB2RSTR_MDPWM_Pos                   (27)
#define  RCC_APB2RSTR_MDPWM_Msk                   (0x1U << RCC_APB2RSTR_MDPWM_Pos)                  /*!<MDPWM Reset Set to '1' or clear '0' by software*/
#define  RCC_APB2RSTR_MDPWM                       RCC_APB2RSTR_MDPWM_Msk
#define  RCC_APB2RSTR_MDS_Pos                     (28)
#define  RCC_APB2RSTR_MDS_Msk                     (0x1U << RCC_APB2RSTR_MDS_Pos)                    /*!<MDS Reset Set to '1' or clear '0' by software*/
#define  RCC_APB2RSTR_MDS                         RCC_APB2RSTR_MDS_Msk
#define  RCC_APB2RSTR_LPTIM_Pos                   (30)
#define  RCC_APB2RSTR_LPTIM_Msk                   (0x1U << RCC_APB2RSTR_LPTIM_Pos)                  /*!<LPTIM Reset Set to '1' or clear '0' by software*/
#define  RCC_APB2RSTR_LPTIM                       RCC_APB2RSTR_LPTIM_Msk
#define  RCC_APB2RSTR_LPUART_Pos                  (31)
#define  RCC_APB2RSTR_LPUART_Msk                  (0x1U << RCC_APB2RSTR_LPUART_Pos)                 /*!<LPUART Reset Set to '1' or clear '0' by software*/
#define  RCC_APB2RSTR_LPUART                      RCC_APB2RSTR_LPUART_Msk

/**
  * @brief RCC_APB1RSTR Register Bit Definition
  */
#define  RCC_APB1RSTR_TIM2_Pos                    (0)
#define  RCC_APB1RSTR_TIM2_Msk                    (0x1U << RCC_APB1RSTR_TIM2_Pos)                   /*!<TIM2 Reset*/
#define  RCC_APB1RSTR_TIM2                        RCC_APB1RSTR_TIM2_Msk
#define  RCC_APB1RSTR_TIM3_Pos                    (1)
#define  RCC_APB1RSTR_TIM3_Msk                    (0x1U << RCC_APB1RSTR_TIM3_Pos)                   /*!<TIM3 Reset*/
#define  RCC_APB1RSTR_TIM3                        RCC_APB1RSTR_TIM3_Msk
#define  RCC_APB1RSTR_TIM4_Pos                    (2)
#define  RCC_APB1RSTR_TIM4_Msk                    (0x1U << RCC_APB1RSTR_TIM4_Pos)                   /*!<TIM4 Reset*/
#define  RCC_APB1RSTR_TIM4                        RCC_APB1RSTR_TIM4_Msk
#define  RCC_APB1RSTR_TIM5_Pos                    (3)
#define  RCC_APB1RSTR_TIM5_Msk                    (0x1U << RCC_APB1RSTR_TIM5_Pos)                   /*!<TIM5 Reset*/
#define  RCC_APB1RSTR_TIM5                        RCC_APB1RSTR_TIM5_Msk
#define  RCC_APB1RSTR_TIM6_Pos                    (4)
#define  RCC_APB1RSTR_TIM6_Msk                    (0x1U << RCC_APB1RSTR_TIM6_Pos)                   /*!<TIM6 Reset*/
#define  RCC_APB1RSTR_TIM6                        RCC_APB1RSTR_TIM6_Msk
#define  RCC_APB1RSTR_TIM7_Pos                    (5)
#define  RCC_APB1RSTR_TIM7_Msk                    (0x1U << RCC_APB1RSTR_TIM7_Pos)                   /*!<TIM7 Reset*/
#define  RCC_APB1RSTR_TIM7                        RCC_APB1RSTR_TIM7_Msk
#define  RCC_APB1RSTR_WWDG_Pos                    (11)
#define  RCC_APB1RSTR_WWDG_Msk                    (0x1U << RCC_APB1RSTR_WWDG_Pos)                   /*!<Window Watchdog Reset*/
#define  RCC_APB1RSTR_WWDG                        RCC_APB1RSTR_WWDG_Msk
#define  RCC_APB1RSTR_SPI2_Pos                    (14)
#define  RCC_APB1RSTR_SPI2_Msk                    (0x1U << RCC_APB1RSTR_SPI2_Pos)                   /*!<SPI2 Reset*/
#define  RCC_APB1RSTR_SPI2                        RCC_APB1RSTR_SPI2_Msk
#define  RCC_APB1RSTR_SPI3_Pos                    (15)
#define  RCC_APB1RSTR_SPI3_Msk                    (0x1U << RCC_APB1RSTR_SPI3_Pos)                   /*!<SPI3 Reset*/
#define  RCC_APB1RSTR_SPI3                        RCC_APB1RSTR_SPI3_Msk
#define  RCC_APB1RSTR_USART2_Pos                  (17)
#define  RCC_APB1RSTR_USART2_Msk                  (0x1U << RCC_APB1RSTR_USART2_Pos)                 /*!<USART2 Reset*/
#define  RCC_APB1RSTR_USART2                      RCC_APB1RSTR_USART2_Msk
#define  RCC_APB1RSTR_USART3_Pos                  (18)
#define  RCC_APB1RSTR_USART3_Msk                  (0x1U << RCC_APB1RSTR_USART3_Pos)                 /*!<USART3 Reset*/
#define  RCC_APB1RSTR_USART3                      RCC_APB1RSTR_USART3_Msk
#define  RCC_APB1RSTR_USART4_Pos                  (19)
#define  RCC_APB1RSTR_USART4_Msk                  (0x1U << RCC_APB1RSTR_USART4_Pos)                 /*!<USART4 Reset*/
#define  RCC_APB1RSTR_USART4                      RCC_APB1RSTR_USART4_Msk
#define  RCC_APB1RSTR_USART5_Pos                  (20)
#define  RCC_APB1RSTR_USART5_Msk                  (0x1U << RCC_APB1RSTR_USART5_Pos)                 /*!<USART5 Reset*/
#define  RCC_APB1RSTR_USART5                      RCC_APB1RSTR_USART5_Msk
#define  RCC_APB1RSTR_I2C1_Pos                    (21)
#define  RCC_APB1RSTR_I2C1_Msk                    (0x1U << RCC_APB1RSTR_I2C1_Pos)                   /*!<I2C1 Reset*/
#define  RCC_APB1RSTR_I2C1                        RCC_APB1RSTR_I2C1_Msk
#define  RCC_APB1RSTR_I2C2_Pos                    (22)
#define  RCC_APB1RSTR_I2C2_Msk                    (0x1U << RCC_APB1RSTR_I2C2_Pos)                   /*!<I2C2 Reset*/
#define  RCC_APB1RSTR_I2C2                        RCC_APB1RSTR_I2C2_Msk
#define  RCC_APB1RSTR_CRS_Pos                     (24)
#define  RCC_APB1RSTR_CRS_Msk                     (0x1U << RCC_APB1RSTR_CRS_Pos)                    /*!<CRS Reset*/
#define  RCC_APB1RSTR_CRS                         RCC_APB1RSTR_CRS_Msk
#define  RCC_APB1RSTR_FlexCAN_Pos                 (25)
#define  RCC_APB1RSTR_FlexCAN_Msk                 (0x1U << RCC_APB1RSTR_FlexCAN_Pos)                /*!<FlexCAN Reset*/
#define  RCC_APB1RSTR_FlexCAN                     RCC_APB1RSTR_FlexCAN_Msk
#define  RCC_APB1RSTR_DBG_Pos                     (26)
#define  RCC_APB1RSTR_DBG_Msk                     (0x1U << RCC_APB1RSTR_DBG_Pos)                    /*!<DBG Reset*/
#define  RCC_APB1RSTR_DBG                         RCC_APB1RSTR_DBG_Msk
#define  RCC_APB1RSTR_BKP_Pos                     (27)
#define  RCC_APB1RSTR_BKP_Msk                     (0x1U << RCC_APB1RSTR_BKP_Pos)                    /*!<Backup Interface Reset*/
#define  RCC_APB1RSTR_BKP                         RCC_APB1RSTR_BKP_Msk
#define  RCC_APB1RSTR_PWR_Pos                     (28)
#define  RCC_APB1RSTR_PWR_Msk                     (0x1U << RCC_APB1RSTR_PWR_Pos)                    /*!<Power Interface Reset*/
#define  RCC_APB1RSTR_PWR                         RCC_APB1RSTR_PWR_Msk
#define  RCC_APB1RSTR_DAC_Pos                     (29)
#define  RCC_APB1RSTR_DAC_Msk                     (0x1U << RCC_APB1RSTR_DAC_Pos)                    /*!<DAC Reset*/
#define  RCC_APB1RSTR_DAC                         RCC_APB1RSTR_DAC_Msk

/**
  * @brief RCC_AHBENR2 Register Bit Definition
  */
#define  RCC_AHBENR2_BKRAM_Pos                    (28)
#define  RCC_AHBENR2_BKRAM_Msk                    (0x1U << RCC_AHBENR2_BKRAM_Pos)                   /*!<*/
#define  RCC_AHBENR2_BKRAM                        RCC_AHBENR2_BKRAM_Msk

/**
  * @brief RCC_AHBENR Register Bit Definition
  */
#define  RCC_AHBENR_GPIOA_Pos                     (0)
#define  RCC_AHBENR_GPIOA_Msk                     (0x1U << RCC_AHBENR_GPIOA_Pos)                    /*!<GPIOA Clock Enable*/
#define  RCC_AHBENR_GPIOA                         RCC_AHBENR_GPIOA_Msk
#define  RCC_AHBENR_GPIOB_Pos                     (1)
#define  RCC_AHBENR_GPIOB_Msk                     (0x1U << RCC_AHBENR_GPIOB_Pos)                    /*!<GPIOB Clock Enable*/
#define  RCC_AHBENR_GPIOB                         RCC_AHBENR_GPIOB_Msk
#define  RCC_AHBENR_GPIOC_Pos                     (2)
#define  RCC_AHBENR_GPIOC_Msk                     (0x1U << RCC_AHBENR_GPIOC_Pos)                    /*!<GPIOC Clock Enable*/
#define  RCC_AHBENR_GPIOC                         RCC_AHBENR_GPIOC_Msk
#define  RCC_AHBENR_GPIOD_Pos                     (3)
#define  RCC_AHBENR_GPIOD_Msk                     (0x1U << RCC_AHBENR_GPIOD_Pos)                    /*!<GPIOD Clock Enable*/
#define  RCC_AHBENR_GPIOD                         RCC_AHBENR_GPIOD_Msk
#define  RCC_AHBENR_GPIOE_Pos                     (4)
#define  RCC_AHBENR_GPIOE_Msk                     (0x1U << RCC_AHBENR_GPIOE_Pos)                    /*!<GPIOE Clock Enable Set '1' or clear '0' by software*/
#define  RCC_AHBENR_GPIOE                         RCC_AHBENR_GPIOE_Msk
#define  RCC_AHBENR_GPIOF_Pos                     (5)
#define  RCC_AHBENR_GPIOF_Msk                     (0x1U << RCC_AHBENR_GPIOF_Pos)                    /*!<GPIOF Clock Enable Set '1' or clear '0' by software*/
#define  RCC_AHBENR_GPIOF                         RCC_AHBENR_GPIOF_Msk
#define  RCC_AHBENR_GPIOH_Pos                     (7)
#define  RCC_AHBENR_GPIOH_Msk                     (0x1U << RCC_AHBENR_GPIOH_Pos)                    /*!<GPIOH Clock Enable Set '1' or clear '0' by software*/
#define  RCC_AHBENR_GPIOH                         RCC_AHBENR_GPIOH_Msk
#define  RCC_AHBENR_GPIOI_Pos                     (8)
#define  RCC_AHBENR_GPIOI_Msk                     (0x1U << RCC_AHBENR_GPIOI_Pos)                    /*!<GPIOI Clock Enable Set '1' or clear '0' by software*/
#define  RCC_AHBENR_GPIOI                         RCC_AHBENR_GPIOI_Msk
#define  RCC_AHBENR_CRC_Pos                       (12)
#define  RCC_AHBENR_CRC_Msk                       (0x1U << RCC_AHBENR_CRC_Pos)                      /*!<CRC Clock Enable Set '1' or clear '0' by software*/
#define  RCC_AHBENR_CRC                           RCC_AHBENR_CRC_Msk
#define  RCC_AHBENR_Flash_Pos                     (13)
#define  RCC_AHBENR_Flash_Msk                     (0x1U << RCC_AHBENR_Flash_Pos)                    /*!<Flash Clock Enable Set '1' or clear '0' by software*/
#define  RCC_AHBENR_Flash                         RCC_AHBENR_Flash_Msk
#define  RCC_AHBENR_SRAM_Pos                      (14)
#define  RCC_AHBENR_SRAM_Msk                      (0x1U << RCC_AHBENR_SRAM_Pos)                     /*!<SRAM Clock Enable Set '1' or clear '0' by software*/
#define  RCC_AHBENR_SRAM                          RCC_AHBENR_SRAM_Msk
#define  RCC_AHBENR_CORDIC_Pos                    (15)
#define  RCC_AHBENR_CORDIC_Msk                    (0x1U << RCC_AHBENR_CORDIC_Pos)                   /*!<CORDIC Clock Enable Set '1' or clear '0' by software*/
#define  RCC_AHBENR_CORDIC                        RCC_AHBENR_CORDIC_Msk
#define  RCC_AHBENR_DMA1_Pos                      (21)
#define  RCC_AHBENR_DMA1_Msk                      (0x1U << RCC_AHBENR_DMA1_Pos)                     /*!<DMA1 Clock Enable Set '1' or clear '0' by software*/
#define  RCC_AHBENR_DMA1                          RCC_AHBENR_DMA1_Msk
#define  RCC_AHBENR_DMA2_Pos                      (22)
#define  RCC_AHBENR_DMA2_Msk                      (0x1U << RCC_AHBENR_DMA2_Pos)                     /*!<DMA2 Clock Enable Set '1' or clear '0' by software*/
#define  RCC_AHBENR_DMA2                          RCC_AHBENR_DMA2_Msk
#define  RCC_AHBENR_USB_FS_Pos                    (24)
#define  RCC_AHBENR_USB_FS_Msk                    (0x1U << RCC_AHBENR_USB_FS_Pos)                   /*!<USB_FS Clock Enable Set '1' or clear '0' by software*/
#define  RCC_AHBENR_USB_FS                        RCC_AHBENR_USB_FS_Msk
#define  RCC_AHBENR_QSPI_Pos                      (30)
#define  RCC_AHBENR_QSPI_Msk                      (0x1U << RCC_AHBENR_QSPI_Pos)                     /*!<QSPI Clock Enable Set '1' or clear '0' by software*/
#define  RCC_AHBENR_QSPI                          RCC_AHBENR_QSPI_Msk

/**
  * @brief RCC_APB2ENR Register Bit Definition
  */
#define  RCC_APB2ENR_TIM1_Pos                     (0)
#define  RCC_APB2ENR_TIM1_Msk                     (0x1U << RCC_APB2ENR_TIM1_Pos)                    /*!<TIM1 Clock Enable*/
#define  RCC_APB2ENR_TIM1                         RCC_APB2ENR_TIM1_Msk
#define  RCC_APB2ENR_TIM8_Pos                     (1)
#define  RCC_APB2ENR_TIM8_Msk                     (0x1U << RCC_APB2ENR_TIM8_Pos)                    /*!<TIM8 Clock Enable*/
#define  RCC_APB2ENR_TIM8                         RCC_APB2ENR_TIM8_Msk
#define  RCC_APB2ENR_USART1_Pos                   (4)
#define  RCC_APB2ENR_USART1_Msk                   (0x1U << RCC_APB2ENR_USART1_Pos)                  /*!<USART1 Clock Enable*/
#define  RCC_APB2ENR_USART1                       RCC_APB2ENR_USART1_Msk
#define  RCC_APB2ENR_ADC1_Pos                     (8)
#define  RCC_APB2ENR_ADC1_Msk                     (0x1U << RCC_APB2ENR_ADC1_Pos)                    /*!<ADC1 Clock Enable*/
#define  RCC_APB2ENR_ADC1                         RCC_APB2ENR_ADC1_Msk
#define  RCC_APB2ENR_ADC2_Pos                     (9)
#define  RCC_APB2ENR_ADC2_Msk                     (0x1U << RCC_APB2ENR_ADC2_Pos)                    /*!<ADC2 Clock Enable*/
#define  RCC_APB2ENR_ADC2                         RCC_APB2ENR_ADC2_Msk
#define  RCC_APB2ENR_ADC3_Pos                     (10)
#define  RCC_APB2ENR_ADC3_Msk                     (0x1U << RCC_APB2ENR_ADC3_Pos)                    /*!<ADC3 Clock Enable*/
#define  RCC_APB2ENR_ADC3                         RCC_APB2ENR_ADC3_Msk
#define  RCC_APB2ENR_SPI1_Pos                     (12)
#define  RCC_APB2ENR_SPI1_Msk                     (0x1U << RCC_APB2ENR_SPI1_Pos)                    /*!<SPI1 Clock Enable*/
#define  RCC_APB2ENR_SPI1                         RCC_APB2ENR_SPI1_Msk
#define  RCC_APB2ENR_SYSCFG_Pos                   (14)
#define  RCC_APB2ENR_SYSCFG_Msk                   (0x1U << RCC_APB2ENR_SYSCFG_Pos)                  /*!<SYSCFG Clock Enable*/
#define  RCC_APB2ENR_SYSCFG                       RCC_APB2ENR_SYSCFG_Msk
#define  RCC_APB2ENR_COMP_Pos                     (15)
#define  RCC_APB2ENR_COMP_Msk                     (0x1U << RCC_APB2ENR_COMP_Pos)                    /*!<Comparator Clock Enable Set to '1' or clear '0' by software*/
#define  RCC_APB2ENR_COMP                         RCC_APB2ENR_COMP_Msk
#define  RCC_APB2ENR_FLEXCAN2_Pos                 (24)
#define  RCC_APB2ENR_FLEXCAN2_Msk                 (0x1U << RCC_APB2ENR_FLEXCAN2_Pos)                /*!<FLEXCAN2 Clock Enable Set to '1' or clear '0' by software*/
#define  RCC_APB2ENR_FLEXCAN2                     RCC_APB2ENR_FLEXCAN2_Msk
#define  RCC_APB2ENR_MDPWM_Pos                    (27)
#define  RCC_APB2ENR_MDPWM_Msk                    (0x1U << RCC_APB2ENR_MDPWM_Pos)                   /*!<MDPWM Clock Enable Set to '1' or clear '0' by software*/
#define  RCC_APB2ENR_MDPWM                        RCC_APB2ENR_MDPWM_Msk
#define  RCC_APB2ENR_MDS_Pos                      (28)
#define  RCC_APB2ENR_MDS_Msk                      (0x1U << RCC_APB2ENR_MDS_Pos)                     /*!<MDS Clock Enable Set to '1' or clear '0' by software*/
#define  RCC_APB2ENR_MDS                          RCC_APB2ENR_MDS_Msk
#define  RCC_APB2ENR_LPTIM_Pos                    (30)
#define  RCC_APB2ENR_LPTIM_Msk                    (0x1U << RCC_APB2ENR_LPTIM_Pos)                   /*!<LPTIM Clock Enable Set to '1' or clear '0' by software*/
#define  RCC_APB2ENR_LPTIM                        RCC_APB2ENR_LPTIM_Msk
#define  RCC_APB2ENR_LPUART_Pos                   (31)
#define  RCC_APB2ENR_LPUART_Msk                   (0x1U << RCC_APB2ENR_LPUART_Pos)                  /*!<LPUART Clock Enable Set to '1' or clear '0' by software*/
#define  RCC_APB2ENR_LPUART                       RCC_APB2ENR_LPUART_Msk

