SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USART/MM32F5370_Bootloader/Device/MM32F5370/Include/reg_rcc.h
/**
  * @brief RCC_APB1ENR Register Bit Definition
  */
#define  RCC_APB1ENR_TIM2_Pos                     (0)
#define  RCC_APB1ENR_TIM2_Msk                     (0x1U << RCC_APB1ENR_TIM2_Pos)                    /*!<TIM2 Clock Enable*/
#define  RCC_APB1ENR_TIM2                         RCC_APB1ENR_TIM2_Msk
#define  RCC_APB1ENR_TIM3_Pos                     (1)
#define  RCC_APB1ENR_TIM3_Msk                     (0x1U << RCC_APB1ENR_TIM3_Pos)                    /*!<TIM3 Clock Enable*/
#define  RCC_APB1ENR_TIM3                         RCC_APB1ENR_TIM3_Msk
#define  RCC_APB1ENR_TIM4_Pos                     (2)
#define  RCC_APB1ENR_TIM4_Msk                     (0x1U << RCC_APB1ENR_TIM4_Pos)                    /*!<TIM4 Clock Enable*/
#define  RCC_APB1ENR_TIM4                         RCC_APB1ENR_TIM4_Msk
#define  RCC_APB1ENR_TIM5_Pos                     (3)
#define  RCC_APB1ENR_TIM5_Msk                     (0x1U << RCC_APB1ENR_TIM5_Pos)                    /*!<TIM5 Clock Enable*/
#define  RCC_APB1ENR_TIM5                         RCC_APB1ENR_TIM5_Msk
#define  RCC_APB1ENR_TIM6_Pos                     (4)
#define  RCC_APB1ENR_TIM6_Msk                     (0x1U << RCC_APB1ENR_TIM6_Pos)                    /*!<TIM6 Clock Enable*/
#define  RCC_APB1ENR_TIM6                         RCC_APB1ENR_TIM6_Msk
#define  RCC_APB1ENR_TIM7_Pos                     (5)
#define  RCC_APB1ENR_TIM7_Msk                     (0x1U << RCC_APB1ENR_TIM7_Pos)                    /*!<TIM7 Clock Enable*/
#define  RCC_APB1ENR_TIM7                         RCC_APB1ENR_TIM7_Msk
#define  RCC_APB1ENR_WWDG_Pos                     (11)
#define  RCC_APB1ENR_WWDG_Msk                     (0x1U << RCC_APB1ENR_WWDG_Pos)                    /*!<Window Watchdog Clock Enable*/
#define  RCC_APB1ENR_WWDG                         RCC_APB1ENR_WWDG_Msk
#define  RCC_APB1ENR_SPI2_Pos                     (14)
#define  RCC_APB1ENR_SPI2_Msk                     (0x1U << RCC_APB1ENR_SPI2_Pos)                    /*!<SPI2 Clock Enable*/
#define  RCC_APB1ENR_SPI2                         RCC_APB1ENR_SPI2_Msk
#define  RCC_APB1ENR_SPI3_Pos                     (15)
#define  RCC_APB1ENR_SPI3_Msk                     (0x1U << RCC_APB1ENR_SPI3_Pos)                    /*!<SPI3 Clock Enable*/
#define  RCC_APB1ENR_SPI3                         RCC_APB1ENR_SPI3_Msk
#define  RCC_APB1ENR_USART2_Pos                   (17)
#define  RCC_APB1ENR_USART2_Msk                   (0x1U << RCC_APB1ENR_USART2_Pos)                  /*!<USART2 Clock Enable*/
#define  RCC_APB1ENR_USART2                       RCC_APB1ENR_USART2_Msk
#define  RCC_APB1ENR_USART3_Pos                   (18)
#define  RCC_APB1ENR_USART3_Msk                   (0x1U << RCC_APB1ENR_USART3_Pos)                  /*!<USART3 Clock Enable*/
#define  RCC_APB1ENR_USART3                       RCC_APB1ENR_USART3_Msk
#define  RCC_APB1ENR_USART4_Pos                   (19)
#define  RCC_APB1ENR_USART4_Msk                   (0x1U << RCC_APB1ENR_USART4_Pos)                  /*!<USART4 Clock Enable*/
#define  RCC_APB1ENR_USART4                       RCC_APB1ENR_USART4_Msk
#define  RCC_APB1ENR_USART5_Pos                   (20)
#define  RCC_APB1ENR_USART5_Msk                   (0x1U << RCC_APB1ENR_USART5_Pos)                  /*!<USART5 Clock Enable*/
#define  RCC_APB1ENR_USART5                       RCC_APB1ENR_USART5_Msk
#define  RCC_APB1ENR_I2C1_Pos                     (21)
#define  RCC_APB1ENR_I2C1_Msk                     (0x1U << RCC_APB1ENR_I2C1_Pos)                    /*!<I2C1 Clock Enable*/
#define  RCC_APB1ENR_I2C1                         RCC_APB1ENR_I2C1_Msk
#define  RCC_APB1ENR_I2C2_Pos                     (22)
#define  RCC_APB1ENR_I2C2_Msk                     (0x1U << RCC_APB1ENR_I2C2_Pos)                    /*!<I2C2 Clock Enable*/
#define  RCC_APB1ENR_I2C2                         RCC_APB1ENR_I2C2_Msk
#define  RCC_APB1ENR_CRS_Pos                      (24)
#define  RCC_APB1ENR_CRS_Msk                      (0x1U << RCC_APB1ENR_CRS_Pos)                     /*!<CRS Clock Enable*/
#define  RCC_APB1ENR_CRS                          RCC_APB1ENR_CRS_Msk
#define  RCC_APB1ENR_FlexCAN_Pos                  (25)
#define  RCC_APB1ENR_FlexCAN_Msk                  (0x1U << RCC_APB1ENR_FlexCAN_Pos)                 /*!<FlexCAN Clock Enable*/
#define  RCC_APB1ENR_FlexCAN                      RCC_APB1ENR_FlexCAN_Msk
#define  RCC_APB1ENR_BKP_Pos                      (27)
#define  RCC_APB1ENR_BKP_Msk                      (0x1U << RCC_APB1ENR_BKP_Pos)                     /*!<Backup Interface Clock Enable*/
#define  RCC_APB1ENR_BKP                          RCC_APB1ENR_BKP_Msk
#define  RCC_APB1ENR_PWR_DBG_Pos                  (28)
#define  RCC_APB1ENR_PWR_DBG_Msk                  (0x1U << RCC_APB1ENR_PWR_DBG_Pos)                 /*!<Power Interface/DBG Clock Enable*/
#define  RCC_APB1ENR_PWR_DBG                      RCC_APB1ENR_PWR_DBG_Msk
#define  RCC_APB1ENR_DAC_Pos                      (29)
#define  RCC_APB1ENR_DAC_Msk                      (0x1U << RCC_APB1ENR_DAC_Pos)                     /*!<DAC Clock Enable*/
#define  RCC_APB1ENR_DAC                          RCC_APB1ENR_DAC_Msk

/**
  * @brief RCC_BDCR Register Bit Definition
  */
#define  RCC_BDCR_LSEON_Pos                       (0)
#define  RCC_BDCR_LSEON_Msk                       (0x1U << RCC_BDCR_LSEON_Pos)                      /*!<*/
#define  RCC_BDCR_LSEON                           RCC_BDCR_LSEON_Msk
#define  RCC_BDCR_LSERDY_Pos                      (1)
#define  RCC_BDCR_LSERDY_Msk                      (0x1U << RCC_BDCR_LSERDY_Pos)                     /*!<*/
#define  RCC_BDCR_LSERDY                          RCC_BDCR_LSERDY_Msk
#define  RCC_BDCR_LSEBYP_Pos                      (2)
#define  RCC_BDCR_LSEBYP_Msk                      (0x1U << RCC_BDCR_LSEBYP_Pos)                     /*!<*/
#define  RCC_BDCR_LSEBYP                          RCC_BDCR_LSEBYP_Msk
#define  RCC_BDCR_RTCSEL_Pos                      (8)
#define  RCC_BDCR_RTCSEL_Msk                      (0x3U << RCC_BDCR_RTCSEL_Pos)                     /*!<*/
#define  RCC_BDCR_RTCSEL                          RCC_BDCR_RTCSEL_Msk
#define  RCC_BDCR_RTCSEL_Bit0                     (0x1U << RCC_BDCR_RTCSEL_Pos) 
#define  RCC_BDCR_RTCSEL_Bit1                     (0x2U << RCC_BDCR_RTCSEL_Pos) 
#define  RCC_BDCR_RTCEN_Pos                       (15)
#define  RCC_BDCR_RTCEN_Msk                       (0x1U << RCC_BDCR_RTCEN_Pos)                      /*!<*/
#define  RCC_BDCR_RTCEN                           RCC_BDCR_RTCEN_Msk
#define  RCC_BDCR_BDRST_Pos                       (16)
#define  RCC_BDCR_BDRST_Msk                       (0x1U << RCC_BDCR_BDRST_Pos)                      /*!<*/
#define  RCC_BDCR_BDRST                           RCC_BDCR_BDRST_Msk
#define  RCC_BDCR_DBP_Pos                         (24)
#define  RCC_BDCR_DBP_Msk                         (0x1U << RCC_BDCR_DBP_Pos)                        /*!<*/
#define  RCC_BDCR_DBP                             RCC_BDCR_DBP_Msk

/**
  * @brief RCC_CSR Register Bit Definition
  */
#define  RCC_CSR_LSION_Pos                        (0)
#define  RCC_CSR_LSION_Msk                        (0x1U << RCC_CSR_LSION_Pos)                       /*!<Internal Low-speed Oscillator Enable*/
#define  RCC_CSR_LSION                            RCC_CSR_LSION_Msk
#define  RCC_CSR_LSIRDY_Pos                       (1)
#define  RCC_CSR_LSIRDY_Msk                       (0x1U << RCC_CSR_LSIRDY_Pos)                      /*!<Internal Low-speed Oscillator Ready*/
#define  RCC_CSR_LSIRDY                           RCC_CSR_LSIRDY_Msk
#define  RCC_CSR_LSIOE_Pos                        (5)
#define  RCC_CSR_LSIOE_Msk                        (0x1U << RCC_CSR_LSIOE_Pos)                       /*!<LSI Output Enable*/
#define  RCC_CSR_LSIOE                            RCC_CSR_LSIOE_Msk
#define  RCC_CSR_PVDRSTEN_Pos                     (6)
#define  RCC_CSR_PVDRSTEN_Msk                     (0x1U << RCC_CSR_PVDRSTEN_Pos)                    /*!<PVD Reset Enable*/
#define  RCC_CSR_PVDRSTEN                         RCC_CSR_PVDRSTEN_Msk
#define  RCC_CSR_LOCKUPEN_Pos                     (7)
#define  RCC_CSR_LOCKUPEN_Msk                     (0x1U << RCC_CSR_LOCKUPEN_Pos)                    /*!<CPU Lockup Reset Enable*/
#define  RCC_CSR_LOCKUPEN                         RCC_CSR_LOCKUPEN_Msk
#define  RCC_CSR_PVDRSTF_Pos                      (22)
#define  RCC_CSR_PVDRSTF_Msk                      (0x1U << RCC_CSR_PVDRSTF_Pos)                     /*!<PVD Reset Flag*/
#define  RCC_CSR_PVDRSTF                          RCC_CSR_PVDRSTF_Msk
#define  RCC_CSR_LOCKUPF_Pos                      (23)
#define  RCC_CSR_LOCKUPF_Msk                      (0x1U << RCC_CSR_LOCKUPF_Pos)                     /*!<CPU Lockup Reset Flag*/
#define  RCC_CSR_LOCKUPF                          RCC_CSR_LOCKUPF_Msk
#define  RCC_CSR_RMVF_Pos                         (24)
#define  RCC_CSR_RMVF_Msk                         (0x1U << RCC_CSR_RMVF_Pos)                        /*!<Remove Reset Flag*/
#define  RCC_CSR_RMVF                             RCC_CSR_RMVF_Msk
#define  RCC_CSR_PINRSTF_Pos                      (26)
#define  RCC_CSR_PINRSTF_Msk                      (0x1U << RCC_CSR_PINRSTF_Pos)                     /*!<PIN Reset Flag*/
#define  RCC_CSR_PINRSTF                          RCC_CSR_PINRSTF_Msk
#define  RCC_CSR_PORRSTF_Pos                      (27)
#define  RCC_CSR_PORRSTF_Msk                      (0x1U << RCC_CSR_PORRSTF_Pos)                     /*!<POR/PDR Reset Flag*/
#define  RCC_CSR_PORRSTF                          RCC_CSR_PORRSTF_Msk
#define  RCC_CSR_SFTRSTF_Pos                      (28)
#define  RCC_CSR_SFTRSTF_Msk                      (0x1U << RCC_CSR_SFTRSTF_Pos)                     /*!<Software Reset Flag*/
#define  RCC_CSR_SFTRSTF                          RCC_CSR_SFTRSTF_Msk
#define  RCC_CSR_IWDGRSTF_Pos                     (29)
#define  RCC_CSR_IWDGRSTF_Msk                     (0x1U << RCC_CSR_IWDGRSTF_Pos)                    /*!<Independent Watchdog Reset Flag*/
#define  RCC_CSR_IWDGRSTF                         RCC_CSR_IWDGRSTF_Msk
#define  RCC_CSR_WWDGRSTF_Pos                     (30)
#define  RCC_CSR_WWDGRSTF_Msk                     (0x1U << RCC_CSR_WWDGRSTF_Pos)                    /*!<Window Watchdog Reset Flag*/
#define  RCC_CSR_WWDGRSTF                         RCC_CSR_WWDGRSTF_Msk
#define  RCC_CSR_LPWRRSTF_Pos                     (31)
#define  RCC_CSR_LPWRRSTF_Msk                     (0x1U << RCC_CSR_LPWRRSTF_Pos)                    /*!<Low Power Reset Flag*/
#define  RCC_CSR_LPWRRSTF                         RCC_CSR_LPWRRSTF_Msk

/**
  * @brief RCC_SYSCFG Register Bit Definition
  */
#define  RCC_SYSCFG_PROG_CHECK_EN_Pos             (0)
#define  RCC_SYSCFG_PROG_CHECK_EN_Msk             (0x1U << RCC_SYSCFG_PROG_CHECK_EN_Pos)            /*!<Check whether the data in Flash is 0xFF when writing Flash*/
#define  RCC_SYSCFG_PROG_CHECK_EN                 RCC_SYSCFG_PROG_CHECK_EN_Msk
#define  RCC_SYSCFG_HSE_RFB_SEL_Pos               (8)
#define  RCC_SYSCFG_HSE_RFB_SEL_Msk               (0x3U << RCC_SYSCFG_HSE_RFB_SEL_Pos)              /*!<HSE_RFB_SEL: Feedback Resistor Selection.*/
#define  RCC_SYSCFG_HSE_RFB_SEL                   RCC_SYSCFG_HSE_RFB_SEL_Msk
#define  RCC_SYSCFG_HSE_RFB_SEL_Bit0              (0x1U << RCC_SYSCFG_HSE_RFB_SEL_Pos) 
#define  RCC_SYSCFG_HSE_RFB_SEL_Bit1              (0x2U << RCC_SYSCFG_HSE_RFB_SEL_Pos) 
#define  RCC_SYSCFG_HSELPFEN_Pos                  (14)
#define  RCC_SYSCFG_HSELPFEN_Msk                  (0x1U << RCC_SYSCFG_HSELPFEN_Pos)                 /*!<External Crystal Low-pass Filter Enable*/
#define  RCC_SYSCFG_HSELPFEN                      RCC_SYSCFG_HSELPFEN_Msk

/**
  * @brief RCC_CFGR2 Register Bit Definition
  */
#define  RCC_CFGR2_TIMADV_CKSEL_Pos               (0)
#define  RCC_CFGR2_TIMADV_CKSEL_Msk               (0x1U << RCC_CFGR2_TIMADV_CKSEL_Pos)              /*!<*/
#define  RCC_CFGR2_TIMADV_CKSEL                   RCC_CFGR2_TIMADV_CKSEL_Msk
#define  RCC_CFGR2_TIMADV_PRE_Pos                 (1)
#define  RCC_CFGR2_TIMADV_PRE_Msk                 (0x7U << RCC_CFGR2_TIMADV_PRE_Pos)                /*!<*/
#define  RCC_CFGR2_TIMADV_PRE                     RCC_CFGR2_TIMADV_PRE_Msk
#define  RCC_CFGR2_TIMADV_PRE_Bit0                (0x1U << RCC_CFGR2_TIMADV_PRE_Pos) 
#define  RCC_CFGR2_TIMADV_PRE_Bit1                (0x2U << RCC_CFGR2_TIMADV_PRE_Pos) 
#define  RCC_CFGR2_TIMADV_PRE_Bit2                (0x4U << RCC_CFGR2_TIMADV_PRE_Pos) 
#define  RCC_CFGR2_CAN1CLKSEL_Pos                 (8)
#define  RCC_CFGR2_CAN1CLKSEL_Msk                 (0x3U << RCC_CFGR2_CAN1CLKSEL_Pos)                /*!<*/
#define  RCC_CFGR2_CAN1CLKSEL                     RCC_CFGR2_CAN1CLKSEL_Msk
#define  RCC_CFGR2_CAN1CLKSEL_Bit0                (0x1U << RCC_CFGR2_CAN1CLKSEL_Pos) 
#define  RCC_CFGR2_CAN1CLKSEL_Bit1                (0x2U << RCC_CFGR2_CAN1CLKSEL_Pos) 
#define  RCC_CFGR2_CAN1PRE_Pos                    (12)
#define  RCC_CFGR2_CAN1PRE_Msk                    (0x3U << RCC_CFGR2_CAN1PRE_Pos)                   /*!<*/
#define  RCC_CFGR2_CAN1PRE                        RCC_CFGR2_CAN1PRE_Msk
#define  RCC_CFGR2_CAN1PRE_Bit0                   (0x1U << RCC_CFGR2_CAN1PRE_Pos) 
#define  RCC_CFGR2_CAN1PRE_Bit1                   (0x2U << RCC_CFGR2_CAN1PRE_Pos) 
#define  RCC_CFGR2_APB1_CLK_HV_PRE_Pos            (16)
#define  RCC_CFGR2_APB1_CLK_HV_PRE_Msk            (0xFU << RCC_CFGR2_APB1_CLK_HV_PRE_Pos)           /*!<APB1_HV Output Clock Division Factor*/
#define  RCC_CFGR2_APB1_CLK_HV_PRE                RCC_CFGR2_APB1_CLK_HV_PRE_Msk
#define  RCC_CFGR2_APB1_CLK_HV_PRE_Bit0           (0x1U << RCC_CFGR2_APB1_CLK_HV_PRE_Pos) 
#define  RCC_CFGR2_APB1_CLK_HV_PRE_Bit1           (0x2U << RCC_CFGR2_APB1_CLK_HV_PRE_Pos) 
#define  RCC_CFGR2_APB1_CLK_HV_PRE_Bit2           (0x4U << RCC_CFGR2_APB1_CLK_HV_PRE_Pos) 
#define  RCC_CFGR2_APB1_CLK_HV_PRE_Bit3           (0x8U << RCC_CFGR2_APB1_CLK_HV_PRE_Pos) 
#define  RCC_CFGR2_MCO_PRE_Pos                    (20)
#define  RCC_CFGR2_MCO_PRE_Msk                    (0xFU << RCC_CFGR2_MCO_PRE_Pos)                   /*!<MCOPRE: MCO Clock Prescaler Factor*/
#define  RCC_CFGR2_MCO_PRE                        RCC_CFGR2_MCO_PRE_Msk
#define  RCC_CFGR2_MCO_PRE_Bit0                   (0x1U << RCC_CFGR2_MCO_PRE_Pos) 
#define  RCC_CFGR2_MCO_PRE_Bit1                   (0x2U << RCC_CFGR2_MCO_PRE_Pos) 
#define  RCC_CFGR2_MCO_PRE_Bit2                   (0x4U << RCC_CFGR2_MCO_PRE_Pos) 
#define  RCC_CFGR2_MCO_PRE_Bit3                   (0x8U << RCC_CFGR2_MCO_PRE_Pos) 
#define  RCC_CFGR2_LPUARTCLKSEL_Pos               (26)
#define  RCC_CFGR2_LPUARTCLKSEL_Msk               (0x3U << RCC_CFGR2_LPUARTCLKSEL_Pos)              /*!<*/
#define  RCC_CFGR2_LPUARTCLKSEL                   RCC_CFGR2_LPUARTCLKSEL_Msk
#define  RCC_CFGR2_LPUARTCLKSEL_Bit0              (0x1U << RCC_CFGR2_LPUARTCLKSEL_Pos) 
#define  RCC_CFGR2_LPUARTCLKSEL_Bit1              (0x2U << RCC_CFGR2_LPUARTCLKSEL_Pos) 
#define  RCC_CFGR2_LPTIMCLKSEL_Pos                (29)
#define  RCC_CFGR2_LPTIMCLKSEL_Msk                (0x3U << RCC_CFGR2_LPTIMCLKSEL_Pos)               /*!<*/
#define  RCC_CFGR2_LPTIMCLKSEL                    RCC_CFGR2_LPTIMCLKSEL_Msk
#define  RCC_CFGR2_LPTIMCLKSEL_Bit0               (0x1U << RCC_CFGR2_LPTIMCLKSEL_Pos) 
#define  RCC_CFGR2_LPTIMCLKSEL_Bit1               (0x2U << RCC_CFGR2_LPTIMCLKSEL_Pos) 

/**
  * @brief RCC_ICSCR Register Bit Definition
  */
#define  RCC_ICSCR_TRIM_CRS_SEL_Pos               (0)
#define  RCC_ICSCR_TRIM_CRS_SEL_Msk               (0x1U << RCC_ICSCR_TRIM_CRS_SEL_Pos)              /*!<*/
#define  RCC_ICSCR_TRIM_CRS_SEL                   RCC_ICSCR_TRIM_CRS_SEL_Msk

/**
  * @brief RCC_PLL1CFGR Register Bit Definition
  */
#define  RCC_PLL1CFGR_PLL1SRC_Pos                 (0)
#define  RCC_PLL1CFGR_PLL1SRC_Msk                 (0x1U << RCC_PLL1CFGR_PLL1SRC_Pos)                /*!<*/
#define  RCC_PLL1CFGR_PLL1SRC                     RCC_PLL1CFGR_PLL1SRC_Msk
#define  RCC_PLL1CFGR_PLL1XTPRE_Pos               (1)
#define  RCC_PLL1CFGR_PLL1XTPRE_Msk               (0x1U << RCC_PLL1CFGR_PLL1XTPRE_Pos)              /*!<*/
#define  RCC_PLL1CFGR_PLL1XTPRE                   RCC_PLL1CFGR_PLL1XTPRE_Msk
#define  RCC_PLL1CFGR_PLL1_ICTRL_Pos              (2)
#define  RCC_PLL1CFGR_PLL1_ICTRL_Msk              (0x3U << RCC_PLL1CFGR_PLL1_ICTRL_Pos)             /*!<*/
#define  RCC_PLL1CFGR_PLL1_ICTRL                  RCC_PLL1CFGR_PLL1_ICTRL_Msk
#define  RCC_PLL1CFGR_PLL1_ICTRL_Bit0             (0x1U << RCC_PLL1CFGR_PLL1_ICTRL_Pos) 
#define  RCC_PLL1CFGR_PLL1_ICTRL_Bit1             (0x2U << RCC_PLL1CFGR_PLL1_ICTRL_Pos) 
#define  RCC_PLL1CFGR_PLL1_LDS_Pos                (4)
#define  RCC_PLL1CFGR_PLL1_LDS_Msk                (0x7U << RCC_PLL1CFGR_PLL1_LDS_Pos)               /*!<PLL1 Lock Detector Accuracy Select*/
#define  RCC_PLL1CFGR_PLL1_LDS                    RCC_PLL1CFGR_PLL1_LDS_Msk
#define  RCC_PLL1CFGR_PLL1_LDS_Bit0               (0x1U << RCC_PLL1CFGR_PLL1_LDS_Pos) 
#define  RCC_PLL1CFGR_PLL1_LDS_Bit1               (0x2U << RCC_PLL1CFGR_PLL1_LDS_Pos) 
#define  RCC_PLL1CFGR_PLL1_LDS_Bit2               (0x4U << RCC_PLL1CFGR_PLL1_LDS_Pos) 
#define  RCC_PLL1CFGR_PLL1DIV_Pos                 (8)
#define  RCC_PLL1CFGR_PLL1DIV_Msk                 (0x7U << RCC_PLL1CFGR_PLL1DIV_Pos)                /*!<PLL1 Divide Factor*/
#define  RCC_PLL1CFGR_PLL1DIV                     RCC_PLL1CFGR_PLL1DIV_Msk
#define  RCC_PLL1CFGR_PLL1DIV_Bit0                (0x1U << RCC_PLL1CFGR_PLL1DIV_Pos) 
#define  RCC_PLL1CFGR_PLL1DIV_Bit1                (0x2U << RCC_PLL1CFGR_PLL1DIV_Pos) 
#define  RCC_PLL1CFGR_PLL1DIV_Bit2                (0x4U << RCC_PLL1CFGR_PLL1DIV_Pos) 
#define  RCC_PLL1CFGR_PLL1MUL_Pos                 (16)
#define  RCC_PLL1CFGR_PLL1MUL_Msk                 (0xFFU << RCC_PLL1CFGR_PLL1MUL_Pos)               /*!<PLL1 Multiplication Factor*/
#define  RCC_PLL1CFGR_PLL1MUL                     RCC_PLL1CFGR_PLL1MUL_Msk
#define  RCC_PLL1CFGR_PLL1MUL_Bit0                (0x01U << RCC_PLL1CFGR_PLL1MUL_Pos) 
#define  RCC_PLL1CFGR_PLL1MUL_Bit1                (0x02U << RCC_PLL1CFGR_PLL1MUL_Pos) 
#define  RCC_PLL1CFGR_PLL1MUL_Bit2                (0x04U << RCC_PLL1CFGR_PLL1MUL_Pos) 
#define  RCC_PLL1CFGR_PLL1MUL_Bit3                (0x08U << RCC_PLL1CFGR_PLL1MUL_Pos) 
#define  RCC_PLL1CFGR_PLL1MUL_Bit4                (0x10U << RCC_PLL1CFGR_PLL1MUL_Pos) 
#define  RCC_PLL1CFGR_PLL1MUL_Bit5                (0x20U << RCC_PLL1CFGR_PLL1MUL_Pos) 
#define  RCC_PLL1CFGR_PLL1MUL_Bit6                (0x40U << RCC_PLL1CFGR_PLL1MUL_Pos) 
#define  RCC_PLL1CFGR_PLL1MUL_Bit7                (0x80U << RCC_PLL1CFGR_PLL1MUL_Pos) 
#define  RCC_PLL1CFGR_PLL1PDIV_Pos                (24)
#define  RCC_PLL1CFGR_PLL1PDIV_Msk                (0x7U << RCC_PLL1CFGR_PLL1PDIV_Pos)               /*!<PLL1 Pre-divider Factor*/
#define  RCC_PLL1CFGR_PLL1PDIV                    RCC_PLL1CFGR_PLL1PDIV_Msk
#define  RCC_PLL1CFGR_PLL1PDIV_Bit0               (0x1U << RCC_PLL1CFGR_PLL1PDIV_Pos) 
#define  RCC_PLL1CFGR_PLL1PDIV_Bit1               (0x2U << RCC_PLL1CFGR_PLL1PDIV_Pos) 
#define  RCC_PLL1CFGR_PLL1PDIV_Bit2               (0x4U << RCC_PLL1CFGR_PLL1PDIV_Pos) 

/**
  * @brief RCC_PLL2CFGR Register Bit Definition
  */
#define  RCC_PLL2CFGR_PLL2SRC_Pos                 (0)
#define  RCC_PLL2CFGR_PLL2SRC_Msk                 (0x1U << RCC_PLL2CFGR_PLL2SRC_Pos)                /*!<*/
#define  RCC_PLL2CFGR_PLL2SRC                     RCC_PLL2CFGR_PLL2SRC_Msk
#define  RCC_PLL2CFGR_PLL2XTPRE_Pos               (1)
#define  RCC_PLL2CFGR_PLL2XTPRE_Msk               (0x1U << RCC_PLL2CFGR_PLL2XTPRE_Pos)              /*!<*/
#define  RCC_PLL2CFGR_PLL2XTPRE                   RCC_PLL2CFGR_PLL2XTPRE_Msk
#define  RCC_PLL2CFGR_PLL2_ICTRL_Pos              (2)
#define  RCC_PLL2CFGR_PLL2_ICTRL_Msk              (0x3U << RCC_PLL2CFGR_PLL2_ICTRL_Pos)             /*!<*/
#define  RCC_PLL2CFGR_PLL2_ICTRL                  RCC_PLL2CFGR_PLL2_ICTRL_Msk
#define  RCC_PLL2CFGR_PLL2_ICTRL_Bit0             (0x1U << RCC_PLL2CFGR_PLL2_ICTRL_Pos) 
#define  RCC_PLL2CFGR_PLL2_ICTRL_Bit1             (0x2U << RCC_PLL2CFGR_PLL2_ICTRL_Pos) 
#define  RCC_PLL2CFGR_PLL2_LDS_Pos                (4)
#define  RCC_PLL2CFGR_PLL2_LDS_Msk                (0x7U << RCC_PLL2CFGR_PLL2_LDS_Pos)               /*!<PLL2 Lock Detector Accuracy Select*/
#define  RCC_PLL2CFGR_PLL2_LDS                    RCC_PLL2CFGR_PLL2_LDS_Msk
#define  RCC_PLL2CFGR_PLL2_LDS_Bit0               (0x1U << RCC_PLL2CFGR_PLL2_LDS_Pos) 
#define  RCC_PLL2CFGR_PLL2_LDS_Bit1               (0x2U << RCC_PLL2CFGR_PLL2_LDS_Pos) 
#define  RCC_PLL2CFGR_PLL2_LDS_Bit2               (0x4U << RCC_PLL2CFGR_PLL2_LDS_Pos) 
#define  RCC_PLL2CFGR_PLL2DIV_Pos                 (8)
#define  RCC_PLL2CFGR_PLL2DIV_Msk                 (0x7U << RCC_PLL2CFGR_PLL2DIV_Pos)                /*!<PLL2 Divide Factor*/
#define  RCC_PLL2CFGR_PLL2DIV                     RCC_PLL2CFGR_PLL2DIV_Msk
#define  RCC_PLL2CFGR_PLL2DIV_Bit0                (0x1U << RCC_PLL2CFGR_PLL2DIV_Pos) 
#define  RCC_PLL2CFGR_PLL2DIV_Bit1                (0x2U << RCC_PLL2CFGR_PLL2DIV_Pos) 
#define  RCC_PLL2CFGR_PLL2DIV_Bit2                (0x4U << RCC_PLL2CFGR_PLL2DIV_Pos) 
#define  RCC_PLL2CFGR_PLL2MUL_Pos                 (16)
#define  RCC_PLL2CFGR_PLL2MUL_Msk                 (0xFFU << RCC_PLL2CFGR_PLL2MUL_Pos)               /*!<PLL2 Multiplication Factor*/
#define  RCC_PLL2CFGR_PLL2MUL                     RCC_PLL2CFGR_PLL2MUL_Msk
#define  RCC_PLL2CFGR_PLL2MUL_Bit0                (0x01U << RCC_PLL2CFGR_PLL2MUL_Pos) 
#define  RCC_PLL2CFGR_PLL2MUL_Bit1                (0x02U << RCC_PLL2CFGR_PLL2MUL_Pos) 
#define  RCC_PLL2CFGR_PLL2MUL_Bit2                (0x04U << RCC_PLL2CFGR_PLL2MUL_Pos) 
#define  RCC_PLL2CFGR_PLL2MUL_Bit3                (0x08U << RCC_PLL2CFGR_PLL2MUL_Pos) 
#define  RCC_PLL2CFGR_PLL2MUL_Bit4                (0x10U << RCC_PLL2CFGR_PLL2MUL_Pos) 
#define  RCC_PLL2CFGR_PLL2MUL_Bit5                (0x20U << RCC_PLL2CFGR_PLL2MUL_Pos) 
#define  RCC_PLL2CFGR_PLL2MUL_Bit6                (0x40U << RCC_PLL2CFGR_PLL2MUL_Pos) 
#define  RCC_PLL2CFGR_PLL2MUL_Bit7                (0x80U << RCC_PLL2CFGR_PLL2MUL_Pos) 
#define  RCC_PLL2CFGR_PLL2PDIV_Pos                (24)
#define  RCC_PLL2CFGR_PLL2PDIV_Msk                (0x7U << RCC_PLL2CFGR_PLL2PDIV_Pos)               /*!<PLL2 Pre-divider Factor*/
#define  RCC_PLL2CFGR_PLL2PDIV                    RCC_PLL2CFGR_PLL2PDIV_Msk
#define  RCC_PLL2CFGR_PLL2PDIV_Bit0               (0x1U << RCC_PLL2CFGR_PLL2PDIV_Pos) 
#define  RCC_PLL2CFGR_PLL2PDIV_Bit1               (0x2U << RCC_PLL2CFGR_PLL2PDIV_Pos) 
#define  RCC_PLL2CFGR_PLL2PDIV_Bit2               (0x4U << RCC_PLL2CFGR_PLL2PDIV_Pos) 

/**
  * @brief RCC_CFGR3 Register Bit Definition
  */
#define  RCC_CFGR3_I2S1CLKSEL_Pos                 (16)
#define  RCC_CFGR3_I2S1CLKSEL_Msk                 (0x1U << RCC_CFGR3_I2S1CLKSEL_Pos)                /*!<*/
#define  RCC_CFGR3_I2S1CLKSEL                     RCC_CFGR3_I2S1CLKSEL_Msk
#define  RCC_CFGR3_I2S2CLKSEL_Pos                 (17)
#define  RCC_CFGR3_I2S2CLKSEL_Msk                 (0x1U << RCC_CFGR3_I2S2CLKSEL_Pos)                /*!<*/
#define  RCC_CFGR3_I2S2CLKSEL                     RCC_CFGR3_I2S2CLKSEL_Msk
#define  RCC_CFGR3_I2S3CLKSEL_Pos                 (18)
#define  RCC_CFGR3_I2S3CLKSEL_Msk                 (0x1U << RCC_CFGR3_I2S3CLKSEL_Pos)                /*!<*/
#define  RCC_CFGR3_I2S3CLKSEL                     RCC_CFGR3_I2S3CLKSEL_Msk

