SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USART/MM32F5370_Bootloader/Device/MM32F5370/Include/reg_rcc.h
/**
  * @brief RCC_CANCFGR Register Bit Definition
  */
#define  RCC_CANCFGR_CAN1CLKSEL_Pos               (0)
#define  RCC_CANCFGR_CAN1CLKSEL_Msk               (0x3U << RCC_CANCFGR_CAN1CLKSEL_Pos)              /*!<*/
#define  RCC_CANCFGR_CAN1CLKSEL                   RCC_CANCFGR_CAN1CLKSEL_Msk
#define  RCC_CANCFGR_CAN1CLKSEL_Bit0              (0x1U << RCC_CANCFGR_CAN1CLKSEL_Pos) 
#define  RCC_CANCFGR_CAN1CLKSEL_Bit1              (0x2U << RCC_CANCFGR_CAN1CLKSEL_Pos) 
#define  RCC_CANCFGR_CAN1PRE_Pos                  (3)
#define  RCC_CANCFGR_CAN1PRE_Msk                  (0x3U << RCC_CANCFGR_CAN1PRE_Pos)                 /*!<*/
#define  RCC_CANCFGR_CAN1PRE                      RCC_CANCFGR_CAN1PRE_Msk
#define  RCC_CANCFGR_CAN1PRE_Bit0                 (0x1U << RCC_CANCFGR_CAN1PRE_Pos) 
#define  RCC_CANCFGR_CAN1PRE_Bit1                 (0x2U << RCC_CANCFGR_CAN1PRE_Pos) 
#define  RCC_CANCFGR_CAN2CLKSEL_Pos               (8)
#define  RCC_CANCFGR_CAN2CLKSEL_Msk               (0x3U << RCC_CANCFGR_CAN2CLKSEL_Pos)              /*!<*/
#define  RCC_CANCFGR_CAN2CLKSEL                   RCC_CANCFGR_CAN2CLKSEL_Msk
#define  RCC_CANCFGR_CAN2CLKSEL_Bit0              (0x1U << RCC_CANCFGR_CAN2CLKSEL_Pos) 
#define  RCC_CANCFGR_CAN2CLKSEL_Bit1              (0x2U << RCC_CANCFGR_CAN2CLKSEL_Pos) 
#define  RCC_CANCFGR_CAN2PRE_Pos                  (11)
#define  RCC_CANCFGR_CAN2PRE_Msk                  (0x3U << RCC_CANCFGR_CAN2PRE_Pos)                 /*!<*/
#define  RCC_CANCFGR_CAN2PRE                      RCC_CANCFGR_CAN2PRE_Msk
#define  RCC_CANCFGR_CAN2PRE_Bit0                 (0x1U << RCC_CANCFGR_CAN2PRE_Pos) 
#define  RCC_CANCFGR_CAN2PRE_Bit1                 (0x2U << RCC_CANCFGR_CAN2PRE_Pos) 

/**
  * @brief RCC_ADC1CFGR Register Bit Definition
  */
#define  RCC_ADC1CFGR_PRE_Pos                     (0)
#define  RCC_ADC1CFGR_PRE_Msk                     (0xFU << RCC_ADC1CFGR_PRE_Pos)                    /*!<*/
#define  RCC_ADC1CFGR_PRE                         RCC_ADC1CFGR_PRE_Msk
#define  RCC_ADC1CFGR_PRE_Bit0                    (0x1U << RCC_ADC1CFGR_PRE_Pos) 
#define  RCC_ADC1CFGR_PRE_Bit1                    (0x2U << RCC_ADC1CFGR_PRE_Pos) 
#define  RCC_ADC1CFGR_PRE_Bit2                    (0x4U << RCC_ADC1CFGR_PRE_Pos) 
#define  RCC_ADC1CFGR_PRE_Bit3                    (0x8U << RCC_ADC1CFGR_PRE_Pos) 
#define  RCC_ADC1CFGR_PRECAL_Pos                  (8)
#define  RCC_ADC1CFGR_PRECAL_Msk                  (0x1FFU << RCC_ADC1CFGR_PRECAL_Pos)               /*!<*/
#define  RCC_ADC1CFGR_PRECAL                      RCC_ADC1CFGR_PRECAL_Msk
#define  RCC_ADC1CFGR_PRECAL_Bit0                 (0x001U << RCC_ADC1CFGR_PRECAL_Pos) 
#define  RCC_ADC1CFGR_PRECAL_Bit1                 (0x002U << RCC_ADC1CFGR_PRECAL_Pos) 
#define  RCC_ADC1CFGR_PRECAL_Bit2                 (0x004U << RCC_ADC1CFGR_PRECAL_Pos) 
#define  RCC_ADC1CFGR_PRECAL_Bit3                 (0x008U << RCC_ADC1CFGR_PRECAL_Pos) 
#define  RCC_ADC1CFGR_PRECAL_Bit4                 (0x010U << RCC_ADC1CFGR_PRECAL_Pos) 
#define  RCC_ADC1CFGR_PRECAL_Bit5                 (0x020U << RCC_ADC1CFGR_PRECAL_Pos) 
#define  RCC_ADC1CFGR_PRECAL_Bit6                 (0x040U << RCC_ADC1CFGR_PRECAL_Pos) 
#define  RCC_ADC1CFGR_PRECAL_Bit7                 (0x080U << RCC_ADC1CFGR_PRECAL_Pos) 
#define  RCC_ADC1CFGR_PRECAL_Bit8                 (0x100U << RCC_ADC1CFGR_PRECAL_Pos) 

/**
  * @brief RCC_ADC2CFGR Register Bit Definition
  */
#define  RCC_ADC2CFGR_PRE_Pos                     (0)
#define  RCC_ADC2CFGR_PRE_Msk                     (0xFU << RCC_ADC2CFGR_PRE_Pos)                    /*!<*/
#define  RCC_ADC2CFGR_PRE                         RCC_ADC2CFGR_PRE_Msk
#define  RCC_ADC2CFGR_PRE_Bit0                    (0x1U << RCC_ADC2CFGR_PRE_Pos) 
#define  RCC_ADC2CFGR_PRE_Bit1                    (0x2U << RCC_ADC2CFGR_PRE_Pos) 
#define  RCC_ADC2CFGR_PRE_Bit2                    (0x4U << RCC_ADC2CFGR_PRE_Pos) 
#define  RCC_ADC2CFGR_PRE_Bit3                    (0x8U << RCC_ADC2CFGR_PRE_Pos) 
#define  RCC_ADC2CFGR_PRECAL_Pos                  (8)
#define  RCC_ADC2CFGR_PRECAL_Msk                  (0x1FFU << RCC_ADC2CFGR_PRECAL_Pos)               /*!<*/
#define  RCC_ADC2CFGR_PRECAL                      RCC_ADC2CFGR_PRECAL_Msk
#define  RCC_ADC2CFGR_PRECAL_Bit0                 (0x001U << RCC_ADC2CFGR_PRECAL_Pos) 
#define  RCC_ADC2CFGR_PRECAL_Bit1                 (0x002U << RCC_ADC2CFGR_PRECAL_Pos) 
#define  RCC_ADC2CFGR_PRECAL_Bit2                 (0x004U << RCC_ADC2CFGR_PRECAL_Pos) 
#define  RCC_ADC2CFGR_PRECAL_Bit3                 (0x008U << RCC_ADC2CFGR_PRECAL_Pos) 
#define  RCC_ADC2CFGR_PRECAL_Bit4                 (0x010U << RCC_ADC2CFGR_PRECAL_Pos) 
#define  RCC_ADC2CFGR_PRECAL_Bit5                 (0x020U << RCC_ADC2CFGR_PRECAL_Pos) 
#define  RCC_ADC2CFGR_PRECAL_Bit6                 (0x040U << RCC_ADC2CFGR_PRECAL_Pos) 
#define  RCC_ADC2CFGR_PRECAL_Bit7                 (0x080U << RCC_ADC2CFGR_PRECAL_Pos) 
#define  RCC_ADC2CFGR_PRECAL_Bit8                 (0x100U << RCC_ADC2CFGR_PRECAL_Pos) 

/**
  * @brief RCC_ADC3CFGR Register Bit Definition
  */
#define  RCC_ADC3CFGR_PRE_Pos                     (0)
#define  RCC_ADC3CFGR_PRE_Msk                     (0xFU << RCC_ADC3CFGR_PRE_Pos)                    /*!<*/
#define  RCC_ADC3CFGR_PRE                         RCC_ADC3CFGR_PRE_Msk
#define  RCC_ADC3CFGR_PRE_Bit0                    (0x1U << RCC_ADC3CFGR_PRE_Pos) 
#define  RCC_ADC3CFGR_PRE_Bit1                    (0x2U << RCC_ADC3CFGR_PRE_Pos) 
#define  RCC_ADC3CFGR_PRE_Bit2                    (0x4U << RCC_ADC3CFGR_PRE_Pos) 
#define  RCC_ADC3CFGR_PRE_Bit3                    (0x8U << RCC_ADC3CFGR_PRE_Pos) 
#define  RCC_ADC3CFGR_PRECAL_Pos                  (8)
#define  RCC_ADC3CFGR_PRECAL_Msk                  (0x1FFU << RCC_ADC3CFGR_PRECAL_Pos)               /*!<*/
#define  RCC_ADC3CFGR_PRECAL                      RCC_ADC3CFGR_PRECAL_Msk
#define  RCC_ADC3CFGR_PRECAL_Bit0                 (0x001U << RCC_ADC3CFGR_PRECAL_Pos) 
#define  RCC_ADC3CFGR_PRECAL_Bit1                 (0x002U << RCC_ADC3CFGR_PRECAL_Pos) 
#define  RCC_ADC3CFGR_PRECAL_Bit2                 (0x004U << RCC_ADC3CFGR_PRECAL_Pos) 
#define  RCC_ADC3CFGR_PRECAL_Bit3                 (0x008U << RCC_ADC3CFGR_PRECAL_Pos) 
#define  RCC_ADC3CFGR_PRECAL_Bit4                 (0x010U << RCC_ADC3CFGR_PRECAL_Pos) 
#define  RCC_ADC3CFGR_PRECAL_Bit5                 (0x020U << RCC_ADC3CFGR_PRECAL_Pos) 
#define  RCC_ADC3CFGR_PRECAL_Bit6                 (0x040U << RCC_ADC3CFGR_PRECAL_Pos) 
#define  RCC_ADC3CFGR_PRECAL_Bit7                 (0x080U << RCC_ADC3CFGR_PRECAL_Pos) 
#define  RCC_ADC3CFGR_PRECAL_Bit8                 (0x100U << RCC_ADC3CFGR_PRECAL_Pos) 

/**
  * @brief RCC_DACCFGR Register Bit Definition
  */
#define  RCC_DACCFGR_PRE_Pos                      (0)
#define  RCC_DACCFGR_PRE_Msk                      (0x7FU << RCC_DACCFGR_PRE_Pos)                    /*!<*/
#define  RCC_DACCFGR_PRE                          RCC_DACCFGR_PRE_Msk
#define  RCC_DACCFGR_PRE_Bit0                     (0x01U << RCC_DACCFGR_PRE_Pos) 
#define  RCC_DACCFGR_PRE_Bit1                     (0x02U << RCC_DACCFGR_PRE_Pos) 
#define  RCC_DACCFGR_PRE_Bit2                     (0x04U << RCC_DACCFGR_PRE_Pos) 
#define  RCC_DACCFGR_PRE_Bit3                     (0x08U << RCC_DACCFGR_PRE_Pos) 
#define  RCC_DACCFGR_PRE_Bit4                     (0x10U << RCC_DACCFGR_PRE_Pos) 
#define  RCC_DACCFGR_PRE_Bit5                     (0x20U << RCC_DACCFGR_PRE_Pos) 
#define  RCC_DACCFGR_PRE_Bit6                     (0x40U << RCC_DACCFGR_PRE_Pos) 

/**
  * @brief RCC_TPIUCFGR Register Bit Definition
  */
#define  RCC_TPIUCFGR_PRE_Pos                     (0)
#define  RCC_TPIUCFGR_PRE_Msk                     (0x3U << RCC_TPIUCFGR_PRE_Pos)                    /*!<*/
#define  RCC_TPIUCFGR_PRE                         RCC_TPIUCFGR_PRE_Msk
#define  RCC_TPIUCFGR_PRE_Bit0                    (0x1U << RCC_TPIUCFGR_PRE_Pos) 
#define  RCC_TPIUCFGR_PRE_Bit1                    (0x2U << RCC_TPIUCFGR_PRE_Pos) 


#endif

